PX4/PX4-Autopilot/src/drivers/stm32/tone_alarm/tone_alarm.cpp
	/* give it to the superclass if we didn't like it */
	if (result == -ENOTTY)
		result = CDev::ioctl(filp, cmd, arg);

	return result;
}

int
ToneAlarm::write(file *filp, const char *buffer, size_t len)
{
	// sanity-check the buffer for length and nul-termination
	if (len > _tune_max)
		return -EFBIG;

	// if we have an existing user tune, free it
	if (_user_tune != nullptr) {

		// if we are playing the user tune, stop
		if (_tune == _user_tune) {
			_tune = nullptr;
			_next = nullptr;
		}

		// free the old user tune
		free((void *)_user_tune);
		_user_tune = nullptr;
	}

	// if the new tune is empty, we're done
	if (buffer[0] == '\0')
		return OK;

	// allocate a copy of the new tune
	_user_tune = strndup(buffer, len);
	if (_user_tune == nullptr)
		return -ENOMEM;

	// and play it
	start_tune(_user_tune);

	return len;
}

/**
 * Local functions in support of the shell command.
 */
namespace
{

ToneAlarm	*g_dev;

int
play_tune(unsigned tune)
{
	int	fd, ret;

	fd = open("/dev/tone_alarm", 0);

	if (fd < 0)
		err(1, "/dev/tone_alarm");

	ret = ioctl(fd, TONE_SET_ALARM, tune);
	close(fd);

	if (ret != 0)
		err(1, "TONE_SET_ALARM");

	exit(0);
}

int
play_string(const char *str)
{
	int	fd, ret;

	fd = open("/dev/tone_alarm", O_WRONLY);

	if (fd < 0)
		err(1, "/dev/tone_alarm");

	ret = write(fd, str, strlen(str) + 1);
	close(fd);

	if (ret < 0)
		err(1, "play tune");
	exit(0);
}

} // namespace

int
tone_alarm_main(int argc, char *argv[])
{
	unsigned tune;

	/* start the driver lazily */
	if (g_dev == nullptr) {
		g_dev = new ToneAlarm;

		if (g_dev == nullptr)
			errx(1, "couldn't allocate the ToneAlarm driver");

		if (g_dev->init() != OK) {
			delete g_dev;
			errx(1, "ToneAlarm init failed");
		}
	}

	if ((argc > 1) && !strcmp(argv[1], "start"))
		play_tune(TONE_STARTUP_TUNE);

	if ((argc > 1) && !strcmp(argv[1], "stop"))
		play_tune(TONE_STOP_TUNE);

	if ((tune = strtol(argv[1], nullptr, 10)) != 0)
		play_tune(tune);

	/* if it looks like a PLAY string... */
	if (strlen(argv[1]) > 2) {
		const char *str = argv[1];
		if (str[0] == 'M') {
			play_string(str);
		}
	}

	errx(1, "unrecognised command, try 'start', 'stop' or an alarm number");
}
